---
kind: method
id: M:Autodesk.Revit.DB.ExternallyTaggedNonBRep.SetUsage(Autodesk.Revit.DB.ExternallyTaggedNonBRepUsage)
source: html/930d3fc8-ce80-a3db-80ea-372958a72f0f.htm
---
# Autodesk.Revit.DB.ExternallyTaggedNonBRep.SetUsage Method

Controls the usage of this ExternallyTaggedNonBRep.

## Syntax (C#)
```csharp
public void SetUsage(
	ExternallyTaggedNonBRepUsage usage
)
```

## Parameters
- **usage** (`Autodesk.Revit.DB.ExternallyTaggedNonBRepUsage`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - A value passed for an enumeration argument is not a member of that enumeration